Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: O how deep is the wealth of the wisdom and knowledge of God! no one is able to make discovery of his decisions, and his ways may not be searched out.
chr: ᎾᏎᏫᏂᏴ ᎤᏣᏔᏅᎯ ᎠᎦᏙᏌᏂᏳ ᎨᏒ ᎠᎴ ᎠᎦᏔᎾᎢᏳ ᎨᏒ ᎤᏁᎳᏅᎯ! ᏂᎦᎥᏉ ᎬᎪᎵᏰᏗ ᏂᎨᏒᎾ ᏄᏍᏛ ᏕᎫᎪᏗᏍᎬᎢ, ᎠᎴ ᎤᏪᏓᏍᏗᏱ ᎨᏒ ᎦᎪᎷᏩᏛᏗ ᏂᎨᏒᎾ!

source: Who has knowledge of the mind of the Lord? or who has taken part in his purposes?
chr: ᎦᎪᏰᏃ ᎤᎦᏙᎥᏐ ᏄᏍᏛ ᎤᏓᏅᏛ ᏱᎰᏩ? ᎠᎴ ᎦᎪ ᎤᎾᏖᏆᎶᏃ ᎤᎾᏓᏅᏖᎶᎢ?

source: Or who has first given to him, and it will be given back to him again?
chr: ᎠᎴ ᎦᎪ ᏚᏓᎴᏅᏔᏅ ᎤᏁᎸ, ᎠᎴ ᏔᎵᏁ ᏛᎠᎦᎫᏴᎡᎵ?

source: For of him, and through him, and to him, are all things. To him be the glory for ever. So be it.
chr: ᎾᏍᎩᏰᏃ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᏂᎦᏗᏳ ᏧᏓᎴᏅᏛ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏩᏂᏌᏛ, ᎠᎴ ᎾᏍᎩ ᎤᎬᏩᎳ; [ᎠᎴ] ᎾᏍᎩ ᎦᎸᏉᏙᏗ ᎨᏎᏍᏗ ᏂᎪᎯᎸᎢ. ᎡᎺᏅ.

source: For this reason I make request to you, brothers, by the mercies of God, that you will give your bodies as a living offering, holy, pleasing to God, which is the worship it is right for you to give him.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎢᏓᎵᏅᏟ, ᎢᏨᏍᏗᏰᏗᎭ ᎤᏁᎳᏅᎯ ᎤᏓᏙᎵᏣᏘᏳ ᎨᏒ ᎢᏳᏍᏗ, ᎾᏍᎩ ᏗᏥᏰᎸ ᏗᏣᎵᏍᎪᎸᏙᏗᏱ ᎬᏃᏛ ᎠᏥᎸ ᎨᎳᏍᏗ, ᎪᎱᏍᏗ ᏄᏍᏛᎾ, ᏗᎬᏩᏓᏂᎸᎢᏍᏗ ᎤᏁᎳᏅᎯ, ᏕᏣᏓᏅᏛ ᎬᏗ ᎪᎱᏍᏗ ᎡᏣᏛᏁᎲᎢ.

source: And let not your behaviour be like that of this world, but be changed and made new in mind, so that by experience you may have knowledge of the good and pleasing and complete purpose of God.
chr: ᎠᎴ ᏞᏍᏗ ᎡᎶᎯ ᎠᏁᎯ ᏄᎾᏍᏛ ᏱᏂᏨᏍᏕᏍᏗ; ᏗᏣᏓᏁᏟᏴᏛᏍᎩᏂ ᎨᏎᏍᏗ ᏗᏤ ᎢᏗᎬᏁᎸᎯ ᎨᏒ ᏕᏣᏓᏅᏛᎢ, ᎾᏍᎩ ᎨᏥᎪᎵᏰᏗ ᎢᏳᎵᏍᏙᏗᏱ ᏄᏍᏛ ᎤᏚᎵᏍᎬ ᎤᏁᎳᏅᎯ, ᎾᏍᎩ ᎣᏍᏛ ᎨᏒᎢ, ᎠᎴ ᏗᎬᏩᏓᏂᎸᎢᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎠᎧᎵᎢ ᎨᏒᎢ.

source: But I say to every one of you, through the grace given to me, not to have an over-high opinion of himself, but to have wise thoughts, as God has given to every one a measure of faith.
chr: ᎬᏩᎦᏘᏯᏰᏃ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎬᏗᏍᎬ, ᎾᏍᎩ ᎥᎩᏁᎸᎯ ᏥᎩ, ᎯᎠ ᏂᎦᏥᏪᏎᎭ ᎾᏂᎥᏉ ᏥᎨᏣᏓᏑᏯ; ᏞᏍᏗᏉ ᏯᏂᎶᏒᏍᏗᏍᎨᏍᏗ ᎠᎾᏓᏅᏖᏍᎬ ᎾᏍᎩ ᏥᏚᏳᎪᏗ ᎤᎾᏓᏅᏖᏗᏱ, ᎤᎾᎵᏏᎾᎯᏍᏗᏍᎩᏂ ᎨᏎᏍᏗ ᎠᎾᏓᏅᏖᏍᎬᎢ, ᎾᏍᎩᏯ ᏄᏍᏛ ᎪᎯᏳᏗ ᎨᏒ ᎤᏁᎳᏅᎯ ᏚᏟᎶᎡᎸ ᎠᏂᏏᏴᏫᎭᎢ.

source: For, as we have a number of parts in one body, but all the parts have not the same use,
chr: ᎤᏣᏘᏰᏃ ᏥᏕᎦᎯᏞᏫᏒ ᏌᏉ ᎠᏰᎸ ᎨᏒᎢ, ᎠᎴ ᎾᎦᏛ ᏕᎦᎯᏞᏫᏒ ᎤᏠᏱ ᏂᎨᏒᎾ ᏥᎩ ᎪᎱᏍᏗ ᎬᏔᏂᏓᏍᏗ ᎨᏒᎢ;

source: So we, though we are a number of persons, are one body in Christ, and are dependent on one another;
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᎠᏴ, ᎢᎩᏣᏘ ᏥᎩ, ᏌᏉᏉ ᎠᏰᎸ ᏂᏓᎵᏍᏗᎭ ᎦᎶᏁᏛ ᏕᏓᏁᎶᏛᎢ, ᎠᎴ ᏂᏗᎥ ᎢᏗᏏᏴᏫᎭ ᎢᎦᏚᏓᏕᏫᏒ.

source: And having different qualities by reason of the grace given to us, such as the quality of a prophet, let it be made use of in relation to the measure of our faith;
chr: ᎾᏍᎩᏃ ᏧᏓᎴᎿᎢ ᎡᎩᏁᎸᏅᎯ ᏥᎩ ᎾᏍᎩᏯ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᎩᏁᎸᎢ, ᎢᏳᏃ ᎠᏙᎴᎰᎯᏍᏗ ᏱᎩ, ᎾᏍᎩᏯ ᎪᎯᏳᏗ ᎨᏒ ᎡᎦᏟᎶᎡᎸ ᎢᏛᏗᏍᎨᏍᏗ [ᎢᏓᏙᎴᎰᏍᎨᏍᏗ;]

source: Or the position of a Deacon of the church, let a man give himself to it; or he who has the power of teaching, let him make use of it;
chr: ᎢᏳ ᎠᎴ ᎢᏗᏯᏙᎯᎮᏍᏗ, ᎢᏗᏯᏙᎯᎲᏉ ᏕᎩᎸᏫᏍᏓᏁᎮᏍᏗ; ᎠᎴ ᎩᎶ ᏓᏕᏲᎲᏍᎨᏍᏗ, ᏗᏕᏲᏗᏉ ᎨᏒ ᏚᎸᏫᏍᏓᏁᎮᏍᏗ;

source: He who has the power of comforting, let him do so; he who gives, let him give freely; he who has the power of ruling, let him do it with a serious mind; he who has mercy on others, let it be with joy.
chr: ᎠᎴ ᎩᎶ ᏗᎦᏬᏁᏗᏍᎩ ᎨᏎᏍᏗ, ᏗᎦᏬᏁᏙᏗᏉ ᎨᏒ ᏚᎸᏫᏍᏓᏁᎮᏍᏗ; ᎠᎴ ᎩᎶ ᏓᏯᏙᎮᎮᏍᏗ, ᏄᎨᏳᎲᏍᎬᎾ ᎾᏍᎩ ᎾᏛᏁᎮᏍᏗ; ᎩᎶ ᏣᎦᏁᎶᏗ ᎨᏎᏍᏗ, ᎣᏍᏛ ᎤᎦᏌᏯᏍᏗ ᎨᏎᏍᏗ; ᎩᎶ ᎠᏓᏙᎵᎨᏍᏗ, ᎤᎧᎵᏍᏗ ᎤᏓᏅᏛ ᎾᏍᎩ ᎾᏛᏁᎮᏍᏗ.

source: Let love be without deceit. Be haters of what is evil; keep your minds fixed on what is good.
chr: ᎠᏓᎨᏳᏗ ᎨᏒ ᏄᏠᎾᏍᏛᎾ ᎨᏎᏍᏗ. ᎢᏥᏂᏆᏘᎮᏍᏗ Ꮎ ᎤᏲ ᎨᏒᎢ; ᏕᏥᏂᏴᏎᏍᏗ ᎣᏍᏛ ᎨᏒᎢ.

source: Be kind to one another with a brother's love, putting others before yourselves in honour;
chr: ᎠᎾᎵᏅᏟ ᏧᎾᏓᎨᏳᏗ ᎨᏒ ᎬᏗ ᎣᏍᏛ ᏕᏣᏓᎨᏳᏎᏍᏗ; ᏗᏓᎸᏉᏙᏗ ᎨᏒ ᎢᏨᏗᏍᎬ ᏕᏣᏓᎬᏫᏳᏗᏍᎨᏍᏗ.

source: Be not slow in your work, but be quick in spirit, as the Lord's servants;
chr: ᏕᏥᎸᏫᏍᏓᏁᎲ ᏞᏍᏗ ᎢᏣᏓᏄᎸᏗ ᏱᎨᏎᏍᏗ; ᎤᎵᏂᎩᏛ ᏕᏣᏓᏅᏖᏍᏗ; ᎪᎱᏍᏗ ᎡᏣᏛᏁᎮᏍᏗ ᎤᎬᏫᏳᎯ.

source: Being glad in hope, quiet in trouble, at all times given to prayer,
chr: ᎤᏚᎩ ᎢᏨᏒ ᎢᏣᎵᎮᎵᎨᏍᏗ; ᏗᏨᏂᏗᏳ ᎨᏎᏍᏗ ᎢᏥᎩᎵᏲᎬᎢ; ᎢᏣᏓᏙᎵᏍᏗᏍᎨᏍᏗ ᏂᎪᎯᎸᎢ;

source: Giving to the needs of the saints, ready to take people into your houses.
chr: ᎤᎾᏓᏅᏘ ᎤᏂᏂᎬᏎᎲ ᏕᏥᏯᏙᎮᎮᏍᏗ; ᎢᏥᎦᎵᏱᏳ ᎨᏎᏍᏗ ᏗᏣᏓᏍᏆᏂᎪᏙᏗᏱ.

source: Give blessing and not curses to those who are cruel to you.
chr: ᎣᏍᏛ ᏕᏥᏁᏤᎮᏍᏗ ᎤᏲ ᎢᎨᏨᎿᏕᎩ; ᎣᏍᏛᏉ ᏕᏥᏁᏤᎮᏍᏗ, ᎠᎴ ᏞᏍᏗ ᏱᏗᏥᏍᎩᏅᏗᏍᎨᏍᏗ.

source: Take part in the joy of those who are glad, and in the grief of those who are sorrowing.
chr: ᎾᏍᎩ Ꮎ ᎠᎾᎵᎮᎵᎩ ᎢᏧᎳᎭ ᎢᏣᎵᎮᎵᎨᏍᏗ, ᎠᎴ ᎾᏍᎩ Ꮎ ᏗᎾᏠᏱᎯ ᎢᏧᎳᎭ ᏕᏣᏠᏱᎮᏍᏗ.

source: Be in harmony with one another. Do not have a high opinion of yourselves, but be in agreement with common people. Do not give yourselves an air of wisdom.
chr: ᎤᏠᏱᎭᏉ ᎨᏎᏍᏗ ᏕᏣᏓᏓᏅᏖᏍᎬᎢ. ᏞᏍᏗ ᏱᏣᎦᏌᏯᏍᏕᏍᏗ ᎪᎱᏍᏗ ᎦᎸᏉᏗ ᎨᏒᎢ, ᏕᏤᎳᏗᏙᎮᏍᏗᏍᎩᏂ ᎤᎾᏓᏙᎵᏍᏗ. ᏞᏍᏗ ᎢᏥᎦᏔᎾᎢ ᏱᏣᏓᏰᎸᏎᏍᏗ.

source: Do not give evil for evil to any man. Let all your business be well ordered in the eyes of all men.
chr: ᎤᏐᏅ ᏂᏨᏁᎮᏍᏗ ᎩᎶ ᏞᏍᏗ ᏱᏣᏞᎨᏍᏗ ᎤᏐᏅ ᏱᏁᏨᏁᎮᏍᏗ. ᎢᎬᏱ ᏂᏣᏓᏅᏖᏍᎨᏍᏗ ᎣᏍᏛ ᎢᏣᏛᏁᎵᏓᏍᏗ ᎨᏒ ᏂᎦᏛ ᎠᏂᎦᏔᎲᎢ.

source: As far as it is possible for you be at peace with all men.
chr: ᎢᏳᏃ ᏰᎵ ᎨᏎᏍᏗ ᏂᎦᎥ ᎢᎨᏣᏛᏁᏗ ᎨᏒ ᎢᏣᏟᏂᎬᏁᎮᏍᏗ ᏙᎯᏱ ᎢᏣᏕᏗᏱ ᎾᏂᎥ ᏴᏫ.

source: Do not give punishment for wrongs done to you, dear brothers, but give way to the wrath of God; for it is said in the holy Writings, Punishment is mine, I will give reward, says the Lord.
chr: ᎢᏨᎨᏳᎢ, ᏞᏍᏗ ᏱᏣᏞᎨᏍᏗ, ᎢᏥᎳᏅᏓᏕᎮᏍᏗᏍᎩᏂ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒᎢ; ᎯᎠᏰᏃ ᏂᎬᏅ ᎪᏪᎳ, ᎠᏞᎢᏍᏗ ᎨᏒ ᎠᏴ ᎠᏆᏤᎵᎦ; ᎠᏴ ᏓᎦᎫᏴᎯ, ᎠᏗᎭ ᏱᎰᏩ.

source: But if one who has hate for you is in need of food or of drink, give it to him, for in so doing you will put coals of fire on his head.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎢᏳᏃ ᏣᏍᎦᎩ ᎠᎪᏄ ᎤᏲᏏᏍᎨᏍᏗ, ᎯᏰᎶᎮᏍᏗ; ᎢᏳᏃ ᎤᏔᏕᎩᏍᎨᏍᏗ, ᎯᎤᎥᏍᎨᏍᏗ; ᎾᏍᎩᏰᏃ ᎿᏛᏁᎲ ᏥᏃᏍᎦ ᏧᏥᏍᏟ ᏕᎯᏡᏍᎨᏍᏗ ᎠᏍᎪᎵ.

source: Do not let evil overcome you, but overcome evil by good.
chr: ᏞᏍᏗ ᎤᏐᏅ ᏁᏨᏁᎸ ᏱᏣᏓᎵᏁᎯᏕᎴᏍᏗ, ᎤᏐᏅᏍᎩᏂ ᏁᏨᏁᎸ ᎯᏯᏓᎵᏁᎯᏕᎮᏍᏗ ᎣᏍᏛ ᎿᏛᏁᎲᎢ.

source: Let everyone put himself under the authority of the higher powers, because there is no power which is not of God, and all powers are ordered by God.
chr: ᎾᏂᎥᏉ ᏚᏃᎯᏳᏎᏍᏗ ᎠᏰᎵ ᏕᎪᏢᏩᏗᏒᎢ. ᎥᏝᏰᏃ ᎠᏰᎵ ᏳᏙᏢᎭ ᎤᏁᎳᏅᎯ ᏅᏓᏳᏓᎴᏅᎯ ᏂᎨᏒᎾ; ᎠᏰᎵ ᏥᏕᎪᏢᎭ ᎤᏁᎳᏅᎯ ᎤᏓᏅᏖᎸᎯ ᏗᎪᏢᏅᎯ.

source: For which reason everyone who puts himself against the authority puts himself against the order of God: and those who are against it will get punishment for themselves.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎩᎶ ᏓᎦᏘᎴᎨᏍᏗ ᎠᏰᎵ ᎪᏢᏒᎢ, ᏓᎦᏘᎴᎨᏍᏗ ᎤᏁᎳᏅᎯ ᎤᏓᏅᏖᎸᎯ ᎪᏢᏅᎯ ᎨᏒᎢ; ᎾᏍᎩᏃ ᏗᏂᎦᏘᎴᎩ ᏧᎾᏚᎪᏓᏁᏗᏱ ᎠᏂᏩᏛᏗᏍᎨᏍᏗ.

source: For rulers are not a cause of fear to the good work but to the evil. If you would have no fear of the authority, do good and you will have praise;
chr: ᏄᏂᎬᏫᏳᏌᏕᎩᏰᏃ ᎥᏝ ᏗᎦᎾᏰᎯᏍᏗ ᏱᎩ ᎣᏍᏛ ᏱᏙᎸᏫᏍᏓᏁᎭ, ᎤᏲᏍᎩᏂ ᏱᏙᎸᏫᏍᏓᏁᎭ. ᏣᏚᎵᏍᎪᏃ ᏣᎾᏰᎯᏍᏗᏱ ᏂᎨᏒᎾ ᎠᏰᎵ ᎪᏢᏒᎢ? ᎣᏍᏛ ᎿᏛᏁᎮᏍᏗ, ᎾᏍᎩᏃ ᏣᎸᏉᏙᏗ ᎨᏎᏍᏗ.

source: For he is the servant of God to you for good. But if you do evil, have fear; for the sword is not in his hand for nothing: he is God's servant, making God's punishment come on the evil-doer.
chr: ᎾᏍᎩᏰᏃ [ᏄᎬᏫᏳᏌᏕᎩ] ᎤᏁᎳᏅᎯ ᎤᏅᏏᏓᏍᏗ ᏂᎯ ᎣᏍᏛ ᎢᏣᎵᏍᏓᏁᏗ ᏧᎸᏫᏍᏓᏁᎯ. ᎢᏳᏍᎩᏂ ᎤᏲᏉ ᏙᏣᎸᏫᏍᏓᏁᎮᏍᏗ, ᎯᏍᎦᎢᎮᏍᏗ; ᎥᏝᏰᏃ ᎠᏎᏃ ᏱᎦᏁᎭ ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ; ᎤᏁᎳᏅᎯᏰᏃ ᎤᏅᏏᏓᏍᏗ ᎾᏍᎩ, ᎤᏞᎩ, ᎠᏍᏛᏗᏍᏗᏍᎩ ᎾᏍᎩ Ꮎ ᎤᏲ ᏧᎸᏫᏍᏓᏁᎯ.

source: So put yourselves under the authority, not for fear of wrath, but because you have the knowledge of what is right.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏎ ᎢᏦᎯᏳᏗ ᎨᏎᏍᏗ, ᎥᏝ ᎤᏓᏍᏛᏗᏍᏗᏉ ᎨᏒ ᎢᏳᏍᏗ, ᏦᏓᏅᏛᏍᎩᏂ ᎾᏍᏉ ᎣᏎᎮᎲ ᎢᏳᏍᏗ.

source: For the same reason, make payment of taxes; because the authority is God's servant, to take care of such things at all times.
chr: ᎾᏍᎩ ᎾᏍᏉ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ ᎠᏰᎵ ᎠᎫᏴᏗ ᎨᏒ ᎢᏣᎫᏱᏍᎨᏍᏗ; ᎤᏁᎳᏅᎯᏰᏃ ᏧᏅᏏᏓᏍᏗ ᎾᏍᎩ, ᏚᏂᎸᏫᏍᏓᏁᎭ ᏂᎪᎯᎸ ᎾᏍᎩ ᎯᎠ.

source: Give to all what is their right: taxes to him whose they are, payment to him whose right it is, fear to whom fear, honour to whom honour is to be given.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏂᎦᏗᏳ ᏗᎫᏴᎡᏗ ᎨᏒ ᏕᏣᎫᏴᎡᎮᏍᏗ; ᎠᏰᎵ ᎡᏣᎫᏴᎡᏗ ᎨᏒ ᎠᏰᎵ ᎡᏣᎫᏴᎡᎮᏍᏗ; ᎢᏥᏃᏔᏅᏗᏱ ᎢᏣᎵᏍᎪᎸᏓᏁᎸ ᎡᏣᎫᏴᎡᏗ ᎨᏒ ᎡᏣᎫᏴᎡᎮᏍᏗ; ᎾᏍᎩ ᎡᏥᎾᏰᎢᏍᏗ ᎨᏒ ᎾᏍᎩ Ꮎ ᎡᏥᎾᏰᏍᎨᏍᏗ; ᎾᏍᎩ ᎡᏥᎸᏉᏙᏗ ᎨᏒ ᎾᏍᎩ Ꮎ ᎡᏥᎸᏉᏕᏍᏗ.

source: Be in debt for nothing, but to have love for one another: for he who has love for his neighbour has kept all the law.
chr: ᏞᏍᏗ ᎩᎶ ᏱᏥᏚᎨᏍᏗ ᎪᎱᏍᏗ, ᏗᏣᏓᎨᏳᏗᏱ ᎤᏩᏒ; ᎩᎶᏰᏃ ᏅᏩᏓᎴ ᏳᎨᏳᎭ ᎤᎧᎵᎸ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎦᏪᏍᎬᎢ.

source: And this, Do not be untrue in married life, Do not put to death, Do not take what is another's, Do not have desire for what is another's, and if there is any other order, it is covered by this word, Have love for your neighbour as for yourself.
chr: ᎯᎠᏰᏃ ᎾᏍᎩ [ᏗᎧᎿᏩᏛᏍᏗ,] ᏞᏍᏗ ᏣᏓᏲᏁᎸᎩ, ᏞᏍᏗ ᏣᏓᎸᎩ, ᏞᏍᏗ ᏣᏃᏍᎩᏒᎩ, ᏞᏍᏗ ᎦᏰᎪᎩ ᏣᏃᎮᎸᎩ, ᏞᏍᏗ ᎪᎱᏍᏗ ᏱᏣᎬᎥᏍᎨᏍᏗ, ᎠᎴ ᏂᎦᎥ ᏅᏩᏓᎴ ᏗᎧᎿᏩᏛᏍᏗ, ᎯᎠᏉ ᎢᎦᏪᏛ ᏥᎩ ᎾᎿ ᎠᏙᏣᎸᏍᎦ ᎤᏍᏆᎳ ᎧᏁᎢᏍᏗ ᎨᏒᎢ, ᏨᏒ ᏂᏣᏓᎨᏳᏒ ᎾᏍᎩᏯ ᏂᎨᏳᏎᏍᏗ ᎾᎥ ᎢᏗᏍᏓᏓᎳ.

source: Love does no wrong to his neighbour, so love makes the law complete.
chr: ᎠᏓᎨᏳᏗ ᎨᏒ ᎥᏝ ᎤᏲ ᏱᏄᏩᏁᎰ ᎾᎥ ᎢᏳᎾᏓᎳ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏓᎨᏳᏗ ᎨᏒ ᎠᎧᎵᎢᎭ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎦᏪᏍᎬᎢ.

source: See then that the time has come for you to be awake from sleep: for now is your salvation nearer than when you first had faith.
chr: ᎠᎴ ᎾᏍᎩ, ᏥᏗᎦᏔᎭ ᎢᏴᏛ ᎠᎵᏱᎵᏒᎢ, ᎾᏍᎩ ᎾᎯᏳ ᎠᏰᎢᏍᏗᏱ ᎢᏗᎵᎲ ᎿᏉ ᎤᎵᏰᎢᎶᎸ; ᎪᎯᏰᏃ ᎡᎩᏍᏕᎸᏗᏱ ᎨᏒ ᎤᏟ ᎾᎥᏂᏳ ᎠᏃ ᎢᎬᏱᏱ ᏗᎪᎯᏳᏅᎢ.

source: The night is far gone, and the day is near: so let us put off the works of the dark, arming ourselves with light,
chr: ᏒᏃᏱ ᎠᏍᏆᎶᎦ, ᎿᏉ ᎤᎩᏨᏂᏗ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏴᏛ ᏂᏛᎦ ᎤᎵᏏᎬ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎢᏓᏄᏬᏍᏓ ᎠᎵᏍᎦᏍᏙᏙ ᎢᎦ-ᎦᏛ ᎡᎯ.

source: With right behaviour as in the day; not in pleasure-making and drinking, not in bad company and unclean behaviour, not in fighting and envy.
chr: ᏚᏳᎪᏛ ᎨᏎᏍᏗ ᎢᏕᎲᎢ, ᎢᎦ ᏂᎨᏐ ᎾᏍᎩᏯᎢ; ᎥᏝᏍᏗᏃ ᎠᎵᏍᎦᎾᏩᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏓᏴᏍᏕᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏕᎵᏛ ᏗᏂᏏᏗ ᎨᏒᎢ, ᎠᎴ ᏃᎵᏏᎾᎯᏍᏛᎾ ᎠᎴᏂᏓᏍᏗ ᎨᏒᎢ, ᎥᏞᏍᏗᏃ ᎠᏗᏒᏍᏗ ᎨᏒᎢ ᎠᎴ ᏗᏓᏛᏳᏤᏗ ᎨᏒᎢ.

source: But put on the Lord Jesus Christ, and do not give thought to the flesh to do its desires.
chr: ᎤᎬᏫᏳᎯᏍᎩᏂ ᏥᏌ ᎦᎶᏁᏛ ᎡᏣᏄᏬᏍᏓ, ᎠᎴ ᏞᏍᏗ ᏱᏣᏛᏅᎢᏍᏓᏁᎴᏍᏗ ᎤᏇᏓᎵ ᎨᏒᎢ, ᎾᏍᎩ ᎤᎬᎥᏍᎬ ᎢᏣᏛᏁᏗᏱ.

source: Do not put on one side him who is feeble in faith, and do not put him in doubt by your reasonings.
chr: ᎩᎶ ᏩᎾᎦᎳ ᎨᏎᏍᏗ ᎤᏬᎯᏳᏒᎢ ᏕᏣᏓᏂᎸᎨᏍᏗ, ᎥᏝ ᎠᏗᎾ ᏗᏧᎪᏙᏗᏱᏉ ᏄᏍᏛ ᎠᏓᏅᏕᏍᎬᎢ.

source: One man has faith to take all things as food: another who is feeble in faith takes only green food.
chr: ᎠᏏᏴᏫ ᏂᎦᎥᏉ ᎪᎱᏍᏗ ᎬᏩᎵᏍᏓᏴᏙᏗ ᎨᏒ ᎤᏬᎯᏳᏐᎢ; ᎩᎶᏃ ᎠᏩᎾᎦᎳ ᎠᏛᏒᎥᏍᎩᏉ ᎠᎵᏍᏓᏴᏗᏍᎪᎢ.

source: Let not him who takes food have a low opinion of him who does not: and let not him who does not take food be a judge of him who does; for he has God's approval.
chr: ᏞᏍᏗ ᎾᏍᎩ Ꮎ ᎠᎵᏍᏓᏴᎲᏍᎩ ᏅᎵᏌᎵᏉ ᏳᏰᎸᏁᏍᏗ Ꮎ ᎾᎵᏍᏓᏴᎲᏍᎬᎾ; ᎠᎴ ᏞᏍᏗ ᎾᏍᎩ Ꮎ ᎾᎵᏍᏓᏴᎲᏍᎬᎾ ᏱᏚᏭᎪᏓᏁᎴᏍᏗ Ꮎ ᎠᎵᏍᏓᏴᎲᏍᎩ; ᎤᏁᎳᏅᎯᏰᏃ ᏚᏓᏂᎸᏨ.

source: Who are you to make yourself a judge of another man's servant? it is to his master that he is responsible for good or bad. Yes, his place will be safe, because the Lord is able to keep him from falling.
chr: ᎦᎪ ᏂᎯ ᏥᏕᎯᏳᎪᏓᏁ ᏅᏩᏓᎴ ᎤᏅᏏᏓᏍᏗ? ᎤᏩᏒᏉ ᎤᏅᏏᏙᎯ ᎤᎵᏍᎦᏍᏙᏗ ᎦᏙᎬ ᎠᎴ ᎦᏅᎬᎢ. ᎥᎥ, ᎠᏥᏲᏍᏙᏓᏁᏗ ᎨᏎᏍᏗ ᎤᏅᎢᏍᏗᏱ; ᎤᏁᎳᏅᎯᏰᏃ ᏰᎵᏉ ᎤᎴᏗᏱ ᎢᎬᏩᏁᏗ.

source: This man puts one day before another: to that man they are the same. Let every man be certain in his mind.
chr: ᎩᎶ ᎤᏟ ᏄᎸᏉᏙ ᎪᎱᏍᏗ ᎤᏍᏗ ᎢᎦ ᎡᏍᎦᏉ ᏅᏩᏓᎴ ᎢᎦ; ᎩᎶᏃ ᏂᎦᎥᏉ ᎢᎦ ᏚᎸᏉᏙᎢ. ᎾᏂᎥ ᎩᎶ ᎠᎧᎵᎢ ᎤᏃᎯᏳᏎᏍᏗ ᎤᏅᏒ ᏙᏧᎾᏓᏅᏛᎢ.

source: He who keeps the day, keeps it to the Lord; and he who takes food, takes it as to the Lord, for he gives praise to God; and he who does not take food, to the Lord he takes it not, and gives praise to God.
chr: ᎩᎶ ᏧᎸᏉᏙ ᎢᎦ ᎤᎬᏫᏳᎯ ᎦᎸᏉᏓᏁᎰᎢ; ᎩᎶᏃ ᏄᎸᏉᏛᎾ ᏥᎨᏐ ᎢᎦ, ᎤᎬᏫᏳᎯ ᎦᎸᏉᏗᏍᎪ ᏄᎸᏉᏛᎾ ᎨᏒᎢ. ᎩᎶ ᏣᎵᏍᏓᏴᎲᏍᎪᎢ, ᎤᎬᏫᏳᎯ ᎠᎵᏍᏓᏴᎾᏁᎰᎢ; ᎤᏁᎳᏅᎯᏰᏃ ᎠᎵᎮᎵᏤᎰᎢ; ᎠᎴ ᎩᎶ ᎾᎵᏍᏓᏴᎲᏍᎬᎾ ᏥᎨᏐᎢ, ᎤᎬᏫᏳᎯ ᎦᎸᏉᏙᏗᏍᎪ ᎾᎵᏍᏓᏴᎲᏍᎬᎾ ᎨᏒᎢ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎠᎵᎮᎵᏤᎰᎢ.

source: For every man's life and every man's death has a relation to others as well as to himself.
chr: ᎥᏝᏰᏃ ᎩᎶ ᎢᎦᏁᎳᎩᏯ ᏱᎩ ᎢᏕᎲᎢ, ᎥᏝ ᎠᎴ ᎩᎶ ᎤᏁᎳᎩᏯ ᏱᎩ ᎠᏲᎱᏍᎬᎢ.

source: As long as we have life we are living to the Lord; or if we give up our life it is to the Lord; so if we are living, or if our life comes to an end, we are the Lord's.
chr: ᎢᏳᏰᏃ ᏱᏓᎴᏂᏙᎭ, ᎤᎬᏫᏳᎯ ᎡᏓᎴᏂᏕᎭ; ᎠᎴ ᎢᏳ ᏱᏗᏗᏲᎱᏍᎦ, ᎤᎬᏫᏳᎯ ᎡᏗᏲᎱᎯᏎᎭ; ᎾᏍᎩᏃ ᎢᏳᏍᏗ ᎢᏳᏃ ᏱᏓᎴᏂᏙᎭ, ᎠᎴ ᏱᏗᏗᏲᎱᏍᎦ, ᎤᎬᏫᏳᎯ ᎡᏓᏤᎵᎦ.

source: And for this purpose Christ went into death and came back again, that he might be the Lord of the dead and of the living.
chr: ᎾᏍᎩᏰᏃ ᎯᎠ ᎤᎬᏩᎴ ᎦᎶᏁᏛ ᏧᏲᎱᏎᎢ, ᎠᎴ ᏥᏚᎴᎯᏌᏁᎢ, ᎠᎴ ᏧᏩᏃᏎᎢ, ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᎢᏳᎵᏍᏙᏗᏱ ᏧᏂᏲᎱᏒᎯ ᎠᎴ ᎾᏍᏉ ᏗᏅᏃᏛ ᎤᎾᏤᎵᎦ.

source: But you, why do you make yourself your brother's judge? or again, why have you no respect for your brother? because we will all have to take our place before God as our judge.
chr: ᎠᎴ ᏂᎯ, ᎦᏙᏃ ᏙᎯᏳᎪᏓᏁᎭ ᎢᏍᏓᎵᏅᏟ? ᎠᎴ ᏂᎯ ᎾᏍᏉ, ᎦᏙᏃ ᏅᎵᏌᎵᏉ ᎢᎯᏰᎸᏍᎦ ᎢᏍᏓᎵᏅᏟ? ᏂᎦᏗᏳᏰᏃ ᎢᎬᏱᏗᏢ ᏫᎦᎴᏗ ᎨᏎᏍᏗ ᎦᎶᏁᏛ ᏧᏭᎪᏙᏗᏱ ᎤᏪᏍᎩᎸᎢ.

source: For it is said in the holy Writings, By my life, says the Lord, to me every knee will be bent, and every tongue will give worship to God.
chr: ᎯᎠᏰᏃ ᏂᎬᏅ ᎪᏪᎳ, ᎨᎥ ᏄᏙᎯᏳᏒᎢ, ᎠᏗᎭ ᏱᎰᏩ, ᏂᎦᏗᏳ ᏙᏓᎬᏆᎵᏂᏆᏅᏁᎵ ᎠᏴ, ᎠᎴ ᏂᎦᏗᏳ ᎬᏂᎨᏒ ᏅᏓᎬᏩᏁᎵ ᎤᏁᎳᏅᎯ.

source: So every one of us will have to give an account of himself to God.
chr: ᎾᏍᎩᏃ ᏥᏄᏍᏗ ᏂᏗᎥ ᎢᏗᏏᏴᏫᎭ ᎨᏒ ᎬᏂᎨᏒ ᎢᏰᏛᏁᏗ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᏂᎦᏛᏁᎵᏙᎸᎢ.

source: Then let us not be judges of one another any longer: but keep this in mind, that no man is to make it hard for his brother, or give him cause for doubting.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏞᏍᏗ ᎪᎯ ᎢᏳᏓᎴᏅᏛ ᏱᏗᏓᏓᏚᎪᏓᏁᎮᏍᏗ; ᎯᎠᏍᎩᏂ ᎤᎬᏫᏳᏎᏍᏗ ᏕᏧᎪᏗᏍᎨᏍᏗ, ᎾᏍᎩ ᎠᏓᏙᏕᏍᏗᏍᎩ ᎠᎴ ᎤᏍᏢᏂᏍᏗᏍᎩ ᎢᏥᏗᏱ ᏂᎨᏒᎾ ᎢᏣᎵᏅᏟ ᎤᎶᎯᏍᏗᏱ.

source: I am conscious of this, and am certain in the Lord Jesus, that nothing is unclean in itself; but for the man in whose opinion it is unclean, for him it is unclean.
chr: ᏥᎦᏔᎭ, ᎠᎴ ᎠᏉᎯᏳᏗ ᎾᏋᏁᎸ ᎤᎬᏫᏳᎯ ᏥᏌ, ᎾᏍᎩ ᎪᎱᏍᏗ ᎤᏩᏒᏉ ᎨᏒ ᎦᏓᎭ ᏂᎨᏒᎾ ᎨᏒᎢ; ᎩᎶᏍᎩᏂ ᎪᎱᏍᏗ ᎦᏓᎭ ᎠᏰᎸᏍᎩ, ᎾᏍᎩ ᎦᏓᎭ ᏄᎵᏍᏓᏁᎰᎢ.

source: And if because of food your brother is troubled, then you are no longer going on in the way of love. Do not let your food be destruction to him for whom Christ went into death.
chr: ᎢᏳᏍᎩᏂ ᏗᏍᏓᏓᏅᏟ ᎠᎵᏍᏓᏴᏗ ᏱᏅᏗᎦᎵᏍᏙᏗᎭ ᎡᎯᏍᏗ ᏱᏯᏓᏅᏓᏗᏍᏔᏅ, ᎿᏉ ᎥᏝ ᎠᏓᎨᏳᏗ ᎨᏒ ᏴᏗᎭ ᎾᏍᎩ ᎿᏛᏁᎲᎢ. ᏞᏍᏗ ᎭᎵᏍᏓᏴᎲᏍᎬ ᎯᏛᏙᏔᏅᎩ ᎾᏍᎩ Ꮎ ᎦᎶᏁᏛ ᎤᏲᎱᎯᏎᎸᎯ.

source: Let it not be possible for men to say evil about your good:
chr: ᎾᏍᎩᏃ ᏞᏍᏗ ᎣᏏᏳ ᏂᏣᏛᏁᎲ ᎤᏐᏅ ᏳᏂᏃᎮᎴᏍᏗ.

source: For the kingdom of God is not food and drink, but righteousness and peace and joy in the Holy Spirit.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎤᏤᎵᎪᎯ ᎥᏝ ᎠᎵᏍᏓᏴᏗᏉ ᎠᎴ ᎠᏗᏔᏍᏗᏉ ᎨᏒ ᏱᎩ; ᏚᏳᎪᏛᏍᎩᏂ ᎨᏒᎢ, ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᎨᏒᎢ, ᎠᎴ ᎠᎵᎮᎵᏍᏗ ᎨᏒᎢ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎢᏳᏩᏂᏌᏛ.

source: And he who in these things is Christ's servant, is pleasing to God and has the approval of men.
chr: ᎩᎶᏰᏃ ᎾᏍᎩ ᎯᎠ ᎤᏮᏗᏕᎬ ᎦᎶᏁᏛ ᎪᎱᏍᏗ ᎠᏛᏁᎮᏍᏗ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏗᎬᏩᏓᏂᎸᎢᏍᏗ ᎨᏎᏍᏗ, ᎠᎴ ᎣᏏᏳ ᎦᎬᏩᏰᎸᏗ ᎨᏎᏍᏗ ᏴᏫ.

source: So then, let us go after the things which make peace, and the things by which we may be a help to one another.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏗᏍᏓᏩᏗᏎᏍᏗ ᎾᏍᎩ ᏙᎯ ᎢᎬᏁᎯ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩ ᏗᎨᎦᏓᎵᏂᎪᎯᏍᏙᏗ ᎨᏒᎢ.

source: Do not let the work of God come to nothing on account of food. All things are certainly clean; but it is evil for that man who by taking food makes it hard for another.
chr: ᏞᏍᏗ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᏱᏣᏲᏍᏔᏁᏍᏗ ᎠᎵᏍᏓᏴᏗᏉ ᏱᏅᏧᎵᏍᏙᏔᏁᏍᏗ. ᏄᏓᎴᏒᏰᏃ ᎪᎱᏍᏗ ᎤᏙᎯᏳᎯ ᎦᏓᎭ ᏂᎨᏒᎾ; ᎤᏲᏍᎩᏂ ᎾᏛᏁᎰ ᎾᏍᎩ Ꮎ ᏴᏫ ᎠᎵᏍᏓᏴᎲᏍᎬ ᎩᎶ ᏱᏗᎪᏕᏍᏗᎭ.

source: It is better not to take meat or wine or to do anything which might be a cause of trouble to your brother.
chr: ᎤᏟ ᎤᏏᏳ ᎭᏫᏯ ᎠᎩᏍᏗᏱ ᏂᎨᏒᎾ, ᎠᎴ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ ᎠᏗᏔᏍᏗᏱ ᏂᎨᏒᎾ, ᎠᎴ ᎪᎱᏍᏗ ᎠᏛᏁᏗᏱ ᏂᎨᏒᎾ, ᎾᏍᎩ ᏗᏍᏓᏓᏅᏟ ᏧᏬᏕᏍᏗᏍᎩ, ᎠᎴ ᎤᏍᏢᏂᏍᏗᏍᎩ, ᎠᎴ ᎠᏩᎾᎦᎳ ᎢᏳᏩᏁᎯ.

source: The faith which you have, have it to yourself before God. Happy is the man who is not judged by that to which he gives approval.
chr: ᎪᎯᏳᏗᏍᎪ ᎨᏒ ᏤᎭ? ᏣᏤᎵᏛ ᏦᎯᏳᏎᏍᏗ ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲᎢ. ᏅᏩᏙᎯᏍᏛ ᎤᏓᏅᏖᏍᏗ ᎩᎶ ᏄᏍᏛ ᎣᏏᏳ ᎤᏰᎸᏒ ᎬᏗᏍᎬ ᎤᏩᏒ ᏂᏓᏓᏚᎪᏓᏁᎲᎾ ᎢᎨᏎᏍᏗ.

source: But he who is in doubt is judged if he takes food, because he does it not in faith; and whatever is not of faith is sin.
chr: ᎩᎶᏍᎩᏂ ᏧᏢᏫᏎᎯ ᏕᎫᎪᏗᏍᎪ ᎤᏍᎦᏅᏨ ᎢᏳᏃ ᏳᎵᏍᏓᏴᏅ, ᏅᏗᎦᎵᏍᏙᏗᏍᎪ ᏄᏬᎯᏳᏒᎾ ᎨᏒ ᎠᎵᏍᏓᏴᎲᏍᎬᎢ; ᏂᎦᎥᏰᏃ ᎪᎱᏍᏗ ᎪᎯᏳᏗ ᎨᏒ ᏅᏗᏓᎴᎲᏍᎬᎾ ᏱᎩ ᎠᏍᎦᏂ ᎨᏐᎢ.

source: We who are strong have to be a support to the feeble, and not give pleasure to ourselves.
chr: ᎠᏴᏃ ᏗᎦᎵᏂᎩᏛ ᏥᎩ ᎤᏁᎳᎩ ᏱᏗᏕᎵᏎᎭ ᏓᏂᏩᎾᎦᎸ ᏗᏂᏩᎾᎦᎳᎢ, ᎠᎴ ᎥᏝ ᎢᎬᏒᏉ ᎣᏍᏛ ᎢᎩᏰᎸᏗ ᏱᏂᎨᏓᏛᏁᎵᏙᎭ.

source: Let every one of us give pleasure to his neighbour for his good, to make him strong.
chr: ᏂᏗᎥ ᎢᏗᏏᏴᏫᎭ ᎨᏒ ᎾᎥ ᎢᎦᏓᎳ ᎣᏍᏛ ᎤᏰᎸᏗ ᎨᏒ ᏂᏓᏛᏁᎮᏍᏗ ᎾᏍᎩ ᎣᏍᏛ ᎨᏒ ᎤᎵᏂᎪᎯᏍᏗᏱ ᎤᎬᏩᎵ.

source: For Christ did not give pleasure to himself, but, as it is said, The bitter words of those who were angry with you came on me.
chr: ᎦᎶᏁᏛᏰᏃ ᎾᏍᏉ ᎥᏝ ᎤᏩᏒᏉ ᎣᏏᏳ ᎤᏰᎸᏗ ᏱᎾᏛᏁᎮᎢ; ᎯᎠᏍᎩᏂ ᏥᏂᎬᏅ ᏥᎪᏪᎳ ᎾᏍᎩᏯ [ᏄᎵᏍᏓᏁᎴᎢ,] ᎦᎬᏩᎾᏓᏐᏢᏛ ᎾᏍᎩ Ꮎ ᎦᎨᏣᏐᏢᏔᏅᎢ ᎠᏴ ᎠᎩᎷᏤᎸᎩ.

source: Now those things which were put down in writing before our time were for our learning, so that through quiet waiting and through the comfort of the holy Writings we might have hope.
chr: ᏄᏓᎴᏒᏰᏃ ᎪᎱᏍᏗ ᎡᏘ ᎪᏪᎳᏅᎯ ᎨᏒ ᎠᏴ ᎢᎦᏕᎶᏆᏍᏗ ᎠᏰᎸᏎ ᎪᏪᎳᏁᎢ, ᎾᏍᎩ ᏗᏛᏂᏗᏳ ᏂᎬᏁᎲ ᎠᎴ ᎤᎦᎵᏍᏗ ᎢᎦᏓᏅᏓᏗᏍᏗᏍᎬ ᎪᏪᎵ ᎾᏍᎩ ᎤᏚᎩ ᎢᎬᎯ ᎢᏳᎵᏍᏙᏗᏱ.

source: Now may the God who gives comfort and strength in waiting make you of the same mind with one another in harmony with Christ Jesus:
chr: ᎾᏍᎩᏃ ᎤᏁᎳᏅᎯ ᎠᎬᏂᏗᏳ ᎠᎴ ᎤᎦᎵᏍᏗ ᎢᏯᏓᏛᏁᎯ ᎢᏥᏁᏗ ᎨᏎᏍᏗ ᎤᏠᏱᏉ ᎢᏣᏓᏅᏓᏗᏍᏗᏱ, ᎾᏍᎩᏯ ᎦᎶᏁᏛ ᏥᏌ ᎠᏓᏅᏖᏍᎬᎢ;

source: So that with one mouth you may give glory to the God and Father of our Lord Jesus Christ.
chr: ᎾᏍᎩ ᏌᏉ ᏕᏣᏓᏅᏛᎢ ᎠᎴ ᏌᏉ ᎢᏥᎰᎵ ᎢᏨᏙᏗᏱ ᎡᏥᎸᏉᏙᏗᏱ ᎤᏁᎳᏅᎯ ᎾᏍᎩ Ꮎ ᎤᏙᏓ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵ ᏥᏌ ᎦᎶᏁᏛ.

source: So then, take one another to your hearts, as Christ took us, to the glory of God.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏕᏣᏓᏓᏂᎸᎨᏍᏗᏉ, ᎾᏍᎩᏯ ᎾᏍᏉ ᎦᎶᏁᏛ ᏕᎦᏓᏂᎸᏨ ᎠᏴ, ᎾᏍᎩ ᎦᎸᏉᏗᏳ ᎢᏯᎬᏁᏗᏱ ᎤᏁᎳᏅᎯ.

source: Now I say that Christ has been made a servant of the circumcision to give effect to the undertakings given by God to the fathers,
chr: ᎠᎴ ᎯᎠ ᏂᏥᏪᎭ, ᎾᏍᎩ ᏥᏌ ᎦᎶᏁᏛ ᏗᎨᏥᎤᏍᏕᏎᎸᎯ ᎤᏂᏅᏏᏓᏍᏗ ᏄᎵᏍᏔᏅᎩ ᎬᏂᎨᏒ ᎢᏳᏩᏁᏗᏱ ᎦᏰᎪᎩ ᏂᎨᏒᎾ ᎨᏒ ᎤᏁᎳᏅᎯ, ᏧᏍᏓᏱᏗᏍᏗᏱ ᎨᏥᏚᎢᏍᏓᏁᎸᎯ ᎨᏒ ᎠᏂᎦᏴᎵᎨᎢ.

source: And so that the Gentiles might give glory to God for his mercy; as it is said, For this reason I will give praise to you among the Gentiles, and I will make a song to your name.
chr: ᎠᎴ ᎾᏍᎩ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᏂᎸᏉᏙᏗᏱ ᎤᏁᎳᏅᎯ ᎤᏓᏙᎵᏍᏗᏳ ᎨᏒ ᎢᏳᏍᏗ; ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᎾᏍᎩ ᎢᏳᏍᏗ ᏓᎬᏁᎢᏍᏔᏂ ᎠᏁᎲ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᎠᎴ ᏙᏓᏥᏃᎩᏍᏔᏂ ᏕᏣᏙᎥᎢ.

source: And again he says, Take part, you Gentiles, in the joy of his people.
chr: ᏔᎵᏁᏃ ᎯᎠ ᏂᎦᏪᎭ, ᎢᏣᎵᎮᎵᎩ ᏗᏣᏓᎴᏅᏛ ᏴᏫ, ᏗᏣᎵᎪᎲᏏ ᏧᏤᎵ ᏴᏫ.

source: And again, Give praise to the Lord, all you Gentiles; and let all the nations give praise to him.
chr: ᏔᎵᏁᏃ, ᎡᏥᎸᏉᏓ ᏱᎰᏩ, ᏂᎦᏗᏳ ᏗᏣᏓᎴᏅᏛ ᏴᏫ; ᎠᎴ ᎡᏥᎸᏉᏓ, ᏂᏥᎥᏉ ᏴᏫ.

source: And again Isaiah says, There will be the root of Jesse, and he who comes to be the ruler over the Gentiles; in him will the Gentiles put their hope.
chr: ᏔᎵᏁᏃ ᎢᏌᏯ ᎯᎠ ᏂᎦᏪᎭ; ᎤᎿᏍᏕᏢ ᎦᎾᏄᎪᎨᏍᏗ ᏤᏏᏱ, ᎠᎴ ᎠᏏᏴᏫ ᏙᏛᎴᏂ ᎤᎬᏫᏳᏌᏕᎩ ᎢᏳᎵᏍᏙᏗᏱ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎠᏁᎲᎢ; ᎾᏍᎩ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᏓᎬᏩᎵᏍᎦᏍᏙᏔᏂ.

source: Now may the God of hope make you full of joy and peace through faith, so that all hope may be yours in the power of the Holy Spirit.
chr: ᎾᏍᎩᏃ ᎤᏁᎳᏅᎯ ᎤᏚᎩ ᎬᏗ ᎨᏒ ᎠᏓᏁᎯ ᎢᏥᎧᎵᎢᏍᏗ ᎨᏎᏍᏗ ᏄᏓᎴᏒ ᎤᎵᎮᎵᏍᏗ ᎨᏒ ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᎨᏒ ᎢᏦᎯᏳᏒ ᎢᏳᏩᏂᏌᏛ, ᎾᏍᎩ ᎤᏣᏔᏅᎯ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏚᎩ ᎢᏨᏒᎢ, ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎤᎵᏂᎬᎬ ᎢᏳᏩᏂᏌᏛ.

source: And I myself am certain of you, brothers, that you are full of what is good, complete in all knowledge, able to give direction to one another.
chr: ᎠᎴ ᎠᏋᏒ ᎾᏍᏉ ᎠᏉᎯᏳᎭ ᏂᎯ ᎢᏨᏯᏓᏅᏖᏍᎬᎢ, ᎢᏓᎵᏅᏟ, ᎾᏍᎩ ᏂᎯ ᎾᏍᏉ ᎣᏍᏛ ᎨᏒ ᎢᏥᎧᎵᎢ ᎨᏒᎢ, ᎠᎴ ᏄᏓᎴᏒ ᎠᎦᏙᎥᎯᏍᏗᎨᏒ ᎢᏥᎧᎵᎥᎢ, ᏰᎵᏉ ᎾᏍᏉ ᏗᎨᏣᏓᎬᏍᎪᎸᏗ ᎨᏒᎢ.

source: But I have, in some measure, less fear in writing to you to put these things before you again, because of the grace which was given to me by God,
chr: ᎠᏎᏃ ᎢᏓᎵᏅᏟ, ᎤᏟ ᎢᎦᎢ ᏂᏥᎾᏰᏍᎬᎾ ᏫᏨᏲᏪᎳᏏ ᎢᏨᏯᏅᏓᏗᏍᏗᏍᎬᎢ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᎤᏁᎳᏅᎯ ᎠᎩᏁᎸ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒᎢ,

source: To be a servant of Christ Jesus to the Gentiles, doing the work of a priest in the good news of God, so that the offering of the Gentiles might be pleasing to God, being made holy by the Holy Spirit.
chr: ᎾᏍᎩ ᏥᏌ ᎦᎶᏁᏛ ᎠᎩᏅᏏᏙᎯ ᎢᏯᏆᎵᏍᏙᏗᏱ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎠᏁᎲᎢ, ᎦᎸᏉᏗᏳ ᏓᎩᎸᏫᏍᏓᏁᎲ ᎣᏍᏛ ᎧᏃᎮᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᎬᏗᏍᎬᎢ, ᎾᏍᎩ ᎦᎵᏍᎪᎸᏗᏍᎬ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎦᏥᏯᎵᏍᎪᎸᏗᏍᎬᎢ ᏧᏓᏂᎸᎢᏍᏗ ᎢᏳᎵᏍᏙᏗᏱ, ᎦᎸᏉᏗᏳ ᎢᏳᏩᏁᎸᎯ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ.

source: So I have pride in Christ Jesus in the things which are God's.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᎩᎭ ᎠᏆᏢᏉᏙᏗ ᏥᏌ ᎦᎶᏁᏛ ᎢᏳᏩᏂᏌᏛ, ᎾᏍᎩ ᎾᎿ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎤᎬᏩᎵ ᎨᏒᎢ.

source: And I will keep myself from talking of anything but those things which Christ has done by me to put the Gentiles under his rule in word and in act,
chr: ᎥᏝᏰᏃ ᏰᎵ ᏴᎦᏥᏁᎢᏍᏓ ᎾᏍᎩ ᎦᎶᏁᏛ ᏄᏛᏁᎸᎾ ᎨᏒ ᎠᏴ ᎠᏋᏗᏍᎬᎢ, ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎬᏩᏃᎯᏳᏗ ᏂᏕᎬᏁᎲᎢ, ᎧᏃᎮᏛ ᎠᎴ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎬᏗᏍᎬᎢ,

source: By signs and wonders, in the power of the Holy Spirit; so that from Jerusalem and round about as far as Illyricum I have given all the good news of Christ;
chr: [ᎠᎴ] ᎬᏗᏍᎬ ᎤᏰᎸᏛᎢ ᎠᎴ ᎤᏍᏆᏂᎪᏗ, ᎤᏁᎳᏅᎯ ᎤᏓᏅᏙ ᎤᎵᏂᎩᏗᏳ ᎨᏒ ᎬᏗᏍᎬᎢ; ᎾᏍᎩ ᏥᎷᏏᎵᎻ ᎤᏓᎴᏅᏛ, ᎠᎴ ᎤᏚᏫᏛ ᎢᎵᎵᎦᎻ ᏩᏍᏗ, ᎤᎧᎵᏨᎯ ᎠᏆᎵᏥᏙᏅ ᎣᏍᏛ ᎧᏃᎮᏛ ᎦᎶᏁᏛ ᎤᏤᎵᎦ;

source: Making it my purpose not to take the good news where Christ was named, so that my work might not be resting on that of others;
chr: ᎾᏍᎩᏃ ᏄᏍᏛᎩ ᎠᏆᏟᏂᎬᏁᎸᎩ ᎣᏍᏛ ᎧᏃᎮᏛ ᎠᏆᎵᏥᏙᏗᏱ, ᎥᏝ ᎾᎿ ᎦᎶᏁᏛ ᎠᏥᏁᎢᏍᏔᏅᎢ, ᎩᎶ ᎤᏅᎯ ᎦᎫᏍᏛᏗ ᎠᏆᏁᏍᎨᏍᏗᏱ ᏂᎨᏒᎾ;

source: But as it is said in the holy Writings, They will see, to whom the news of him had not been given, and those to whose ears it had not come will have knowledge.
chr: ᎾᏍᎩᏯᏍᎩᏂ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᎾᏍᎩ ᎨᏥᏁᎢᏍᏓᏁᎸᎯ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎾᏍᎩ ᏛᏂᎪᎯ; ᎠᎴ ᎾᏍᎩ Ꮎ ᎤᎾᏛᎦᏅᎯ ᏂᎨᏒᎾ ᎨᏒ ᎾᏍᎩ ᏛᏃᎵᏥ.

source: For which reason I was frequently kept from coming to you:
chr: ᎾᏍᎩ ᎾᏍᏉ ᏅᏗᎦᎵᏍᏙᏗᎭ ᎤᏣᏘ ᏧᏓᎴᏅᏛ ᎠᎩᏲᏍᏙᏓᏏ ᏫᏨᎷᏤᏗᏱ;

source: But now, having no longer any place in these parts and having had for a number of years a great desire to come to you,
chr: ᎪᎯᏍᎩᏂ ᎿᏉ ᎢᎸᎯᏢ ᏄᏜᏅᏛᎾ ᏥᎩ ᎠᏂ ᎤᏚᏫᏛ, ᎠᎴ ᎢᎸᏍᎩ ᎾᏕᏘᏴ ᎤᏣᏘ ᏥᏅᏆᏚᎵᏍᎪ ᏫᏨᎷᏤᏗᏱ;

source: Whenever I go to Spain (for it is my hope to see you on my way, and to be sent on there by you, if first I may in some measure have been comforted by your company)--
chr: ᎢᏳᏃ ᏍᏆᏂᏱ ᎨᏒᎭ, ᏫᏨᎷᏤᏗ ᎨᏎᏍᏗ; ᎤᏚᎩᏰᏃ ᎠᏋᎭ ᎢᏨᎪᏩᏛᏗᏱ ᎾᎿ ᏫᏥᎦᏖᏍᏗ, ᎠᎴ ᎾᎿ ᎢᏗᏢ ᏫᏍᎩᏯᎪᏗᏱ, ᎢᏳᏃ ᎢᎬᏱ ᎠᎴᏉ ᏰᎵ ᎾᎩᏰᎸᏁᏍᏗ ᎢᏨᏰᎳᏗᏙᎸᎢ.

source: But now I go to Jerusalem, taking help for the saints.
chr: ᎪᎯᏍᎩᏂ ᏥᎩ ᎠᏇᏏᏗ ᏥᎷᏏᎵᎻ ᎦᏥᏍᏕᎸᎯ ᎤᎾᏓᏅᏘ.

source: For it has been the good pleasure of those of Macedonia and Achaia to send a certain amount of money for the poor among the saints at Jerusalem.
chr: ᎣᏏᏳᏰᏃ ᎤᏂᏰᎸᏅ ᎹᏏᏙᏂ ᎠᎴ ᎡᎦᏯ ᎠᏁᎯ ᎪᎱᏍᏗ ᎤᏂᏗᏱ ᏅᏲ ᎢᏳᎾᏛᎿᏕᎩ ᎤᎾᏓᏅᏘ ᏥᎷᏏᎵᎻ ᎠᏁᎯ ᎤᎾᎵᏍᏕᎸᏙᏗ.

source: Yes, it has been their good pleasure; and they are in their debt. For if the Gentiles have had a part in the things of the Spirit which were theirs, it is right for them, in the same way, to give them help in the things of the flesh.
chr: ᎣᏏᏳ ᎤᏂᏰᎸᏅ ᎤᏙᎯᏳᎯ; ᎠᎴ ᎾᏍᎩ ᎬᏩᏂᏚᎦ. ᎢᏳᏰᏃ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᏁᎳᏗᏍᏔᏅᎯ ᏱᎩ ᎾᏍᎩ ᎤᎾᏤᎵ ᏧᏓᎴᏅᏛ ᎠᏓᏅᏙ ᎤᎵᏍᏕᎸᏙᏗ ᎤᎬᏩᎵ, ᎢᏳᎾᏛᏁᏗ ᎾᏍᏉ ᏄᎾᎵᏍᏓᏁᎲᎩ ᎾᏍᎩ ᏧᏂᏍᏕᎸᏗᏱ ᎤᏇᏓᎵ ᎤᎵᏍᏕᎸᏙᏗ ᎤᎬᏩᎵ.

source: So when I have done this, and have given them this fruit of love, I will go on by you into Spain.
chr: ᎾᏍᎩᏃ ᎢᏳᏍᏗ ᎿᏉ ᎾᏍᎩ ᎯᎠ ᏥᏍᏆᏛᎭ, ᎠᎴ ᏄᏜᏏᏛᏒᎾ ᏂᎦᏥᏴᏁᎸ ᎤᏂᎪᏩᏛᏗᏱ, ᎯᎠ ᎾᏍᎩ ᎤᏓᏔᏅᎯ, ᏫᏨᎶᎢᏍᏓᏁᏗ ᎨᏎᏍᏗ ᏍᏆᏂᏱ ᏫᏥᎦᏖᏍᏗ.

source: And I am certain that when I come, I will be full of the blessing of Christ.
chr: ᎠᎴ ᏥᎦᏔᎭ, ᎾᏍᎩ ᎿᏉ ᏫᏨᎷᏤᎸᎭ ᏂᎦᎥ ᎣᏍᏛ ᎤᏓᏁᏗ ᎨᏒ ᎣᏍᏛ ᎧᏃᎮᏛ ᎦᎶᏁᏛ ᎤᏤᎵᎦ ᏥᏰᎮᏍᏗ ᏫᏨᎷᏤᏗ ᎨᏎᏍᏗ.

source: Now I make request to you, brothers, by our Lord Jesus Christ, and by the love of the Spirit, that you will be working together with me in your prayers to God for me;
chr: ᎠᎴ ᎢᏨᏍᏗᏰᏗᎭ ᎢᏓᎵᏅᏟ, ᎤᎬᏫᏳᎯ ᏥᏌ ᎦᎶᏁᏛ ᏅᏗᎦᎵᏍᏙᏗᎭ, ᎠᎴ ᏅᏗᎦᎵᏍᏙᏗᎭ ᎠᏓᎨᏳᏗ ᎨᏒ ᎠᏓᏅᏙ ᎤᏓᏁᏗ ᎨᏒᎢ, ᎾᏍᎩ ᏍᎩᏯᎵᎪᏁᏗᏱ ᎤᏁᎳᏅᎯ ᎡᏓᏓᏙᎵᏍᏓᏁᎲ ᎠᏴ ᎨᏒ ᎤᎬᏩᎵ,

source: So that I may be kept safe from those in Judaea who have not put themselves under the rule of God, and that the help which I am taking for Jerusalem may be pleasing to the saints;
chr: ᎾᏍᎩ ᎦᏥᏯᏚᏓᎳᎡᏗᏱ ᎾᏍᎩ Ꮎ ᎠᏃᎯᏳᎲᏍᎩ ᏂᎨᏒᎾ ᏧᏗᏱ ᎠᏁᎯ; ᎠᎴ ᎾᏍᎩ ᎦᏥᏴᎡᎲ ᏥᎷᏏᎵᎻ ᎠᏁᎯ, ᏧᎾᏓᏂᎸᎢᏍᏗᏱᏉ ᎤᎾᏓᏅᏘ;

source: So that I may come to you in joy by the good pleasure of God, and have rest with you.
chr: ᎠᎴ ᎾᏍᎩ ᎠᏴ ᎣᏏᏳ ᎤᏰᎸᏅᎯ ᎤᏁᎳᏅᎯ, ᎤᎵᎮᎵᏍᏗ ᎠᏆᏓᏅᏛ ᏫᏨᎷᏤᏗᏱ, ᎠᎴ ᎢᏧᎳᎭ ᏂᎯ ᏗᎩᎦᎵᏍᏙᎯᏍᏗᏱ.

source: Now may the God of peace be with you all. So be it.
chr: ᎤᏁᎳᏅᎯᏃ ᏅᏩᏙᎯᏯᏛ ᎠᏓᏁᎯ ᏂᏥᎥ ᎢᏤᎳᏗᏙᎮᏍᏗ. ᎡᎺᏅ

source: It is my desire to say a good word for Phoebe, who is a servant of the church in Cenchreae:
chr: ᎬᏂᎨᏒ ᏂᏨᏴᏁᎭ ᎣᎩᏙ ᏈᎩ, ᎾᏍᎩ ᎠᏯᏙᎯᎯ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏡᎬ ᎡᏟᏯ;

source: That you will take her in kindly, after the way of the saints, as one who is the Lord's, and give her help in anything in which she may have need of you: because she has been a help to a great number and to myself.
chr: ᎾᏍᎩ ᏤᏣᏓᏂᎸᎢᏍᏗᏱ ᎤᎬᏫᏳᎯ ᎨᏒ ᏅᏓᏳᎵᏍᏙᏗᏱ, ᎾᏍᎩᏯ ᏥᏚᏳᎪᏗ ᎢᏳᎾᏛᏁᏗᏱ ᎤᎾᏓᏅᏘ, ᎠᎴ ᎾᏍᎩ ᎡᏥᏍᏕᎸᏗᏱ ᏂᎦᎥᏉ ᎪᎱᏍᏗ ᎡᏥᏍᏕᎸᏗᏱ ᎤᏚᎵᏍᎬᎢ; ᎾᏍᎩᏰᏃ ᎤᏂᏣᏘ ᏧᏍᏕᎸᏛ, ᎠᎴ ᎠᏴ ᎾᏍᏉ ᎠᎩᏍᏕᎸᏛ.

source: Give my love to Prisca and Aquila, workers with me in Christ Jesus,
chr: ᏕᏥᏲᎵᎸᎭ ᏈᏏᎳ ᎠᎴ ᎡᏈᎳ, ᎢᏧᎳᎭ ᏦᎩᎸᏫᏍᏓᏁᎯ ᎦᎶᏁᏛ ᎤᏤᎵ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ.

source: Who for my life put their necks in danger; to whom not only I but all the churches of the Gentiles are in debt:
chr: ᎾᏍᎩ ᎠᏴ ᎬᏅ ᎠᏂᏍᏕᎵᏍᎬᎢ, ᎤᏅᏒ ᏗᏂᏴᏤᏂ ᎡᎳᏗ ᏚᏂᏅᏅ; ᎾᏍᎩ, ᎥᏝ ᎠᏋᏒᏉ ᏱᎦᏥᏯᎵᎡᎵᏤᎭ, ᎾᏍᏉᏍᎩᏂ ᏂᎦᏛ ᏧᎾᏁᎶᏗ ᏚᎾᏓᏡᏩᏗᏒ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ;

source: And say a kind word to the church which is in their house. Give my love to my dear Epaenetus, who is the first fruit of Asia to Christ.
chr: ᎠᎴ ᎾᏍᏉ ᏕᏥᏲᎵᎸᎭ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏡᎬ ᎾᎿ ᎠᏂᏁᎸᎢ. ᎡᏥᏲᎵᎸᎭ ᎤᏣᏘ ᏥᎨᏳᎢ ᎢᏈᏂᏓ, ᎾᏍᎩ ᎢᎬᏱᏱ ᎤᎦᏛᎾᏨᎯ ᏥᏂᎦᎵᏍᏗᎭ ᎡᎦᏯ ᎦᎶᏁᏛ ᎠᎵᏍᎪᎸᏓᏁᏗ.

source: Give my love to Mary, who gave much care to you.
chr: ᎺᎵ ᎡᏥᏲᎵᎸᎭ, ᎤᏣᏘ ᏧᎸᏫᏍᏓᏁᎸᎯ ᏥᎩ ᎠᏴ ᎣᎩᏍᏕᎵᏍᎬᎢ.

source: Give my love to Andronicus and Junia, my relations, who were in prison with me, who are noted among the Apostles, and who were in Christ before me.
chr: ᎥᏠᏂᎦ ᎠᎴ ᏧᏂᏯ ᏕᏥᏲᎵᎸᎭ, ᎾᏍᎩ ᎪᎱᏍᏗ ᏗᏋᏅ, ᎠᎴ ᎢᏧᎳᎭ ᏦᎩᏴᎩᏅᎯ, ᎾᏍᎩ ᎨᏥᎸᏉᏗ ᏥᎩ ᎨᏥᏅᏏᏛ ᎠᏁᎲᎢ; ᎾᏍᎩ ᎾᏍᏉ ᎢᎬᏱ ᎦᎶᏁᏛ ᏧᎾᏁᎶᏗ ᎢᏳᎾᎵᏍᏔᏅᎯ ᎠᏴ ᎣᏂ.

source: Give my love to Ampliatus, who is dear to me in the Lord,
chr: ᎠᎻᏟᏯ ᎡᏥᏲᎵᎸᎭ, ᎾᏍᎩ ᏥᎨᏳᎢ ᎢᏧᎳᎭ ᎣᏍᏙᎯᏳᎲᏍᎩ ᎤᎬᏫᏳᎯ.

source: Give my love to Urbanus, a worker in Christ with us, and to my dear Stachys.
chr: ᎠᏇᏂ ᎡᏥᏲᎵᎸᎭ ᎢᏧᎳᎭ ᏦᎩᎸᏫᏍᏓᏁᎯ ᎦᎶᏁᏛ ᎤᏤᎵ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ; ᎠᎴ ᏍᏕᎩ ᏥᎨᏳᎢ.
